---
kind: method
id: M:Autodesk.Revit.DB.Edge.Evaluate(System.Double)
source: html/04b5f212-2c3c-a906-7a2c-b8684c63cdad.htm
---
# Autodesk.Revit.DB.Edge.Evaluate Method

Evaluates a parameter on the edge.

## Syntax (C#)
```csharp
public XYZ Evaluate(
	double param
)
```

## Parameters
- **param** (`System.Double`) - The parameter to be evaluated, in [0,1].